<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Join.me image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.mort666.pkg.joinme</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JoinMe</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.mort666.download.joinme</string>
    <key>Process</key>
    <array>
    <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
            <key>pkgroot</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            <key>pkgdirs</key>
            <dict>
                <key>Applications</key>
                <string>0775</string>
            </dict>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
            <key>archive_path</key>
            <string>%pathname%</string>
            <key>destination_path</key>
            <string>%pkgroot%/Applications</string>
            <key>purge_destination</key>
            <true/>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
            <key>pkg_request</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-1.0</string>
                <key>version</key>
                <string>1.0</string>
                <key>id</key>
                <string>me.join</string>
                <key>options</key>
                <string>purge_ds_store</string>
                <key>options</key>
                <string>purge_ds_store</string>
                <key>chown</key>
                <array>
                    <dict>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>admin</string>
                    </dict>
                </array>
            </dict>
        </dict>
    </dict>
    </array>
</dict>
</plist>
